'use strict';

/** Lesson 1 tasks :
 1. Перевод температуры из Цельсия в Фаренгейты, написать функцию
 2. Объявить переменную и константу и присвоить им значения.
 3. Выполнить операции и объяснить полученные выражения:
 a) console.log(10 + 10 + "10");
 b) console.log(10 + "10" + 10);
 c) console.log(10 + 10 + +"10");
 d) console.log(10 / -"");
 e) console.log(10 / +"2,5");
 4. Объяснить что такое ASYNC и DEFER и в чём между ними разница
 5. Написать функцию поиска счастливого билетика из шести цифр (когда сумма правых трёх числе равна сумме
 трёх левых чисел. На вход подать номер билетика
 */